#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
aws_iam_role.cluster: Refreshing state... [id=eks-cluster-role]
aws_vpc.vpc_fiap: Refreshing state... [id=vpc-010f16571fa311b12]
aws_iam_role.node: Refreshing state... [id=eks-node-group-role]
aws_s3_bucket.spoobucket-aula: Refreshing state... [id=spoo-ent9-backend]
aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_8WFN60vOL]
aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_internet_gateway.igw: Refreshing state... [id=igw-0f0f22899a823d278]
aws_subnet.subnet_public[0]: Refreshing state... [id=subnet-0341ea6cbee44892d]
aws_subnet.subnet_public[2]: Refreshing state... [id=subnet-002f5fe47cefd8ec6]
aws_subnet.subnet_public[1]: Refreshing state... [id=subnet-0fb15db31cc264a2b]
aws_security_group.sg: Refreshing state... [id=sg-0a12852399a48e434]
aws_route_table.rt_public: Refreshing state... [id=rtb-0451d282c4206d2d6]
aws_eks_cluster.cluster: Refreshing state... [id=eks-spoo-ent9-backend]
aws_route_table_association.rt_association_1: Refreshing state... [id=rtbassoc-064050008a95ef37a]
aws_route_table_association.rt_association_0: Refreshing state... [id=rtbassoc-091d76efafbdc8d10]
aws_route_table_association.rt_association_2: Refreshing state... [id=rtbassoc-0ca73350ac731c0ca]
data.aws_eks_cluster_auth.auth: Reading...
aws_eks_access_entry.app_deploy_actions_access: Refreshing state... [id=eks-spoo-ent9-backend:arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role]
aws_security_group_rule.cluster_inbound_from_nodes: Refreshing state... [id=sgrule-1442357864]
aws_eks_node_group.node: Refreshing state... [id=eks-spoo-ent9-backend:nodeg-spoo-ent9-backend]
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster_auth.auth: Read complete after 0s [id=eks-spoo-ent9-backend]
aws_eks_access_policy_association.access_entry_association: Refreshing state... [id=eks-spoo-ent9-backend#arn:aws:iam::579375260812:user/camila#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy]
aws_eks_access_entry.access_entry: Refreshing state... [id=eks-spoo-ent9-backend:arn:aws:iam::579375260812:user/camila]
aws_eks_access_entry.infra_actions_access: Refreshing state... [id=eks-spoo-ent9-backend:arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra]
data.aws_eks_cluster.cluster: Read complete after 0s [id=eks-spoo-ent9-backend]
aws_eks_access_policy_association.app_deploy_actions_admin_policy: Refreshing state... [id=eks-spoo-ent9-backend#arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_policy_association.infra_actions_admin_policy: Refreshing state... [id=eks-spoo-ent9-backend#arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_cognito_user_pool.main has been deleted
  - resource "aws_cognito_user_pool" "main" {
      - id                         = "us-east-1_8WFN60vOL" -> null
        name                       = "SistemaPedidosUserPool"
        # (16 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "SistemaPedidosUserPool"
      + region                     = "us-east-1"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)
      + user_pool_tier             = (known after apply)

      + admin_create_user_config (known after apply)

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = false
          + require_numbers                  = false
          + require_symbols                  = false
          + require_uppercase                = false
          + temporary_password_validity_days = (known after apply)
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "custom:cpf"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "14"
              + min_length = "11"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "email"
          + required            = false
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # aws_cognito_user_pool_client.main will be created
  + resource "aws_cognito_user_pool_client" "main" {
      + access_token_validity                         = 60
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ADMIN_NO_SRP_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = 60
      + logout_urls                                   = (known after apply)
      + name                                          = "SistemaPedidosAppClient"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = [
          + "custom:cpf",
          + "email",
        ]
      + refresh_token_validity                        = (known after apply)
      + region                                        = "us-east-1"
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = [
          + "custom:cpf",
          + "email",
        ]

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "days"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ client_id    = "us-east-1_8WFN60vOL" -> (known after apply)
  ~ user_pool_id = "us-east-1_8WFN60vOL" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @2rspoo, Action: `pull_request`*